tutorials/tutorials/lagrangian/reactingParcelFoam/verticalChannelLTS/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.00379;
        rhoInlet        1.0;    // fallback value for e.g. potentialFoam
    }
    inletSides
    {
        type            flowRateInletVelocity;
        massFlowRate  constant 0.00832;
        rhoInlet        1.0;    // fallback value for e.g. potentialFoam
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
